Reports/ВедомостьАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииОСБухгалтерскийУчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НачислениеАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИспользованияДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДооценокОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаОС</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиАмортизацииОСБухгалтерскийУчет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГрафикАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГодовыеГрафикиАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВедомостьАмортизацииОСБухгалтерскийУчет/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "Организация", Организация);
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		ОтчетПоДокументу = Ложь;
		
	КонецЕсли;
	
	Если ОтчетПоДокументу Тогда
		
		МоментДокумента = Документ.МоментВремени();
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачГраница", МоментДокумента);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонГраница", МоментДокумента);
		
		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("СубконтоОС" , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйСубконто.Значение КАК ОС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
		|ГДЕ
		|	ХозрасчетныйСубконто.Вид = &СубконтоОС
		|	И ХозрасчетныйСубконто.Регистратор = &Регистратор";
		СписокОС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОС");
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС = Неопределено Тогда
			
			ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Добавить("ОсновноеСредство");	
			
		КонецЕсли;
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Истина;
			ОтборПоОС.ВидСравнения  = ВидСравнения.ВСписке;         
			ОтборПоОС.Значение.ЗагрузитьЗначения(СписокОС);
			
		КонецЕсли;
		
	Иначе
		
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачДата"   , ОбщийОтчет.ДатаНач);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонДата"   , КонецДня(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачГраница", ОбщийОтчет.ДатаНач);
		
		Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", Неопределено);
			
		Иначе
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", КонецДня(ОбщийОтчет.ДатаКон));
			
		КонецЕсли;
	
	КонецЕсли; 
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);
	
	Если ОтчетПоДокументу Тогда
		// Очищается отбор	
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Ложь;
			ОтборПоОС.ВидСравнения  = ВидСравнения.Равно;         
			ОтборПоОС.Значение      = Справочники.ОсновныеСредства.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	Текст =
	"ВЫБРАТЬ Разрешенные
	|	ПервоначальныеСведения.ОсновноеСредство                           КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.ОсновноеСредство)            КАК ОсновноеСредствоПредставление,
	|	ПервоначальныеСведения.Организация                                КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.Организация)                 КАК ОрганизацияПредставление,
	|	ПервоначальныеСведения.ИнвентарныйНомер                           КАК ИнвентарныйНомер,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                    КАК ПервоначальнаяСтоимость,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета                              КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетУчета)               КАК СчетУчетаПредставление,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации              КАК СчетНачисленияАмортизации,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации)	КАК СчетНачисленияАмортизацииПредставление,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации                КАК СпособНачисления,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.СпособНачисленияАмортизации) КАК СпособНачисленияПредставление,
	|	МестонахождениеОС.МОЛ                                             КАК МОЛ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.МОЛ)                              КАК МОЛПредставление,
	|	МестонахождениеОС.Местонахождение                                 КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.Местонахождение)                  КАК ПодразделениеПредставление,
	|	ВводВЭксплуатацию.ДатаСостояния                                   КАК ДатаВводаВЭксплуатацию,
	|	ВводВЭксплуатацию.Регистратор                                     КАК ДокументВводаВЭксплуатацию,
	|	ПРЕДСТАВЛЕНИЕ(ВводВЭксплуатацию.Регистратор)                      КАК ДокументВводаВЭксплуатациюПредставление,
	|	СнятиеСУчета.ДатаСостояния                                        КАК ДатаСнятияСУчета,
	|	СнятиеСУчета.Регистратор                                          КАК ДокументСнятияСучета,
	|	ПРЕДСТАВЛЕНИЕ(СнятиеСУчета.Регистратор)                           КАК ДокументСнятияСучетаПредставление,
	|	Стоимость.СуммаНачальныйОстатокДт                                 КАК СтоимостьНачальныйОстаток,
	|	Стоимость.СуммаКонечныйОстатокДт                                  КАК СтоимостьКонечныйОстаток,
	|	Стоимость.СуммаОборотДт                                           КАК СтоимостьОборотДт,
	|	Стоимость.СуммаОборотКт                                           КАК СтоимостьОборотКт,
	|	Амортизация.СуммаНачальныйОстатокКт                               КАК АмортизацияНачальныйОстаток,
	|	Амортизация.СуммаКонечныйОстатокКт                                КАК АмортизацияКонечныйОстаток,
	|	Амортизация.СуммаОборотДт                                         КАК АмортизацияОборотДт,
	|	Амортизация.СуммаОборотКт                                         КАК АмортизацияОборотКт,
	|	ЕСТЬNULL(Стоимость.СуммаКонечныйОстатокДт, 0) 
	|		- ЕСТЬNULL(Амортизация.СуммаКонечныйОстатокКт, 0)             КАК ОстаточнаяСтоимость,
	|	Выработка.КоличествоОборот                                        КАК ВыработкаОборот,
	|	ПараметрыАмортизации.СрокПолезногоИспользования                   КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизации.ОбъемПродукцииРабот                          КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации    КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации            КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации  КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                      КАК ЛиквидационнаяСтоимость,
	|	ВЫБОР
	|		КОГДА СнятиеСУчета.ДатаСостояния ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                             КАК СнятоСУчета
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*                                             КАК ОсновноеСредство,
	|	Организация.*                                                  КАК Организация,
	|	ИнвентарныйНомер,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	СпособНачисления,
	|	МОЛ.*                                                          КАК МОЛ,
	|	Подразделение.*                                                КАК Подразделение,
	|	ДатаВводаВЭксплуатацию,
	|	ДокументВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ДокументСнятияСучета,
	|	ГрафикиАмортизации.ГрафикАмортизации.*                         КАК ГрафикАмортизации,
	|	НаправленияАмортизации.СпособыОтраженияРасходовПоАмортизации.* КАК СпособОтраженияРасходовПоАмортизации,
	|	НачислениеАмортизации.НачислятьАмортизацию                     КАК НачислятьАмортизацию,
	|	ПервоначальныеСведения.ПараметрВыработки.*                     КАК ПараметрВыработки,
	|	СнятоСУчета}
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|	                &КонГраница, Организация = &Организация 
	|	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПервоначальныеСведения
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК НачислениеАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НачислениеАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = НачислениеАмортизации.Организация}
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПараметрыАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ПараметрыАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = ПараметрыАмортизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			                   &НачГраница,
	|		                       &КонГраница, , ,
	|		                       Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Стоимость
	|		ПО ПервоначальныеСведения.ОсновноеСредство = Стоимость.Субконто1
	|			И ПервоначальныеСведения.Организация = Стоимость.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|		                       &НачГраница,
	|		                       &КонГраница, , ,
	|		                       Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Амортизация
	|		ПО ПервоначальныеСведения.ОсновноеСредство = Амортизация.Субконто1
	|			И ПервоначальныеСведения.Организация = Амортизация.Организация
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК МестонахождениеОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = МестонахождениеОС.Организация}
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.ВыработкаОС.Обороты(&НачГраница, &КонГраница, ,
	|			                  {ОсновноеСредство.* КАК ОсновноеСредство}) КАК Выработка
	|		ПО ПервоначальныеСведения.ОсновноеСредство = Выработка.ОсновноеСредство
	|			И ПервоначальныеСведения.ПараметрВыработки = Выработка.ПараметрВыработки
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = ВводВЭксплуатацию.Организация
	|			И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК СнятиеСУчета
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СнятиеСУчета.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = СнятиеСУчета.Организация
	|			И (СнятиеСУчета.Состояние = &СостояниеСнятоСУчета)
	|		И СнятиеСУчета.Организация = &Организация И СнятиеСУчета.ДатаСостояния <= &КонДата }
	
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница,
	|			                Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ГрафикиАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = ГрафикиАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = ГрафикиАмортизации.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК НаправленияАмортизации
	|		ПО ПервоначальныеСведения.ОсновноеСредство = НаправленияАмортизации.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = НаправленияАмортизации.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			                &КонГраница, Организация = &Организация
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаБухгалтерскогоУчетаОС
	|		ПО ПервоначальныеСведения.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|			И ПервоначальныеСведения.Организация = СчетаБухгалтерскогоУчетаОС.Организация}
	|{ГДЕ
	|	ПервоначальныеСведения.ОсновноеСредство.*                        КАК ОсновноеСредство,
	|	ПервоначальныеСведения.Организация.*                             КАК Организация,
	|	ПервоначальныеСведения.ИнвентарныйНомер                          КАК ИнвентарныйНомер,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета.*                           КАК СчетУчета,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации.*           КАК СчетНачисленияАмортизации,
	|	МестонахождениеОС.МОЛ.*                                          КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.*                              КАК Подразделение,
	|	ВводВЭксплуатацию.ДатаСостояния                                  КАК ДатаВводаВЭксплуатацию,
	|	ВводВЭксплуатацию.Регистратор.*                                  КАК ДокументВводаВЭксплуатацию,
	|	СнятиеСУчета.ДатаСостояния                                       КАК ДатаСнятияСУчета,
	|	СнятиеСУчета.Регистратор.*                                       КАК ДокументСнятияСучета,
	|	ПервоначальныеСведения.ПервоначальнаяСтоимость                   КАК ПервоначальнаяСтоимость,
	|	Стоимость.СуммаНачальныйОстатокДт                                КАК СтоимостьНачальныйОстаток,
	|	Стоимость.СуммаКонечныйОстатокДт                                 КАК СтоимостьКонечныйОстаток,
	|	Стоимость.СуммаОборотДт                                          КАК СтоимостьОборотДт,
	|	Стоимость.СуммаОборотКт                                          КАК СтоимостьОборотКт,
	|	Амортизация.СуммаНачальныйОстатокДт                              КАК АмортизацияНачальныйОстаток,
	|	Амортизация.СуммаКонечныйОстатокКт                               КАК АмортизацияКонечныйОстаток,
	|	Амортизация.СуммаОборотДт                                        КАК АмортизацияОборотДт,
	|	Амортизация.СуммаОборотКт                                        КАК АмортизацияОборотКт,
	|	ЕСТЬNULL(Стоимость.СуммаКонечныйОстатокДт, 0) 
	|		- ЕСТЬNULL(Амортизация.СуммаКонечныйОстатокКт, 0)            КАК ОстаточнаяСтоимость,
	|	Выработка.КоличествоОборот                                       КАК ВыработкаОборот,
	|	ГрафикиАмортизации.ГрафикАмортизации.*                           КАК ГрафикАмортизации,
	|	НаправленияАмортизации.СпособыОтраженияРасходовПоАмортизации.*   КАК СпособОтраженияРасходовПоАмортизации,
	|	НачислениеАмортизации.НачислятьАмортизацию                       КАК НачислятьАмортизацию,
	|	ПараметрыАмортизации.СрокПолезногоИспользования                  КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизации.ОбъемПродукцииРабот                         КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации   КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации           КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                     КАК ЛиквидационнаяСтоимость,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации               КАК СпособНачисления,
	|	ПервоначальныеСведения.ПараметрВыработки.*                       КАК ПараметрВыработки,
	|	ВЫБОР
	|			КОГДА СнятиеСУчета.ДатаСостояния ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ                                                        КАК СнятоСУчета}
	|
	|// Снятые с учета внутри периода не выводим
	|	ГДЕ ((СнятиеСУчета.ДатаСостояния Есть NULL) ИЛИ (СнятиеСУчета.ДатаСостояния >= &ДатаНач))
	|
	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	ИнвентарныйНомер,
	|	ПервоначальнаяСтоимость,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	МОЛ,
	|	Подразделение,
	|	ДатаВводаВЭксплуатацию,
	|	ДокументВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ДокументСнятияСучета,
	|	СнятоСУчета}
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(СтоимостьОборотКт),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборотДт),
	|	СУММА(АмортизацияОборотКт),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ВыработкаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Организация
	|{ИТОГИ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	МОЛ,
	|	Подразделение,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации КАК СпособНачисления,
	|	СнятоСУчета}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "Организация", 	"Организация");
	СтруктураПредставлениеПолей.Вставить( "Подразделение", 	"Подразделение");
	СтруктураПредставлениеПолей.Вставить( "МОЛ", 			"МОЛ");
	
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство", НСтр("ru='Основное средство';uk='Основний засіб'"));
	СтруктураПредставлениеПолей.Вставить( "СнятоСУчета"     , НСтр("ru='ОС снято с учета';uk='ОЗ знято з обліку'"));
	СтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер", НСтр("ru='Инв. номер';uk='Інв. номер'"));
	
	СтруктураПредставлениеПолей.Вставить( "СпособНачисления"                    , НСтр("ru='Способ начисления амортизации';uk='Спосіб нарахування амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "ПараметрВыработки"                   , НСтр("ru='Параметр выработки';uk='Параметр виробітку'"));
	СтруктураПредставлениеПолей.Вставить( "НачислятьАмортизацию"                , НСтр("ru='Начислять амортизацию';uk='Нараховувати амортизацію'"));
	СтруктураПредставлениеПолей.Вставить( "СчетУчета"                           , НСтр("ru='Счет учета';uk='Рахунок'"));
	СтруктураПредставлениеПолей.Вставить( "СчетНачисленияАмортизации"           , НСтр("ru='Счет нач. амортизации';uk='Рахунок нар. амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию"              , НСтр("ru='Дата ввода в эксплуатацию';uk='Дата введення в експлуатацію'"));
	СтруктураПредставлениеПолей.Вставить( "ДокументВводаВЭксплуатацию"          , НСтр("ru='Док. ввода в эксплуатацию';uk='Док. введення в експлуатацію'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета"                    , НСтр("ru='Дата снятия с учета';uk='Дата зняття з обліку'"));
	СтруктураПредставлениеПолей.Вставить( "ДокументСнятияСучета"                , НСтр("ru='Док. снятия с учета';uk='Док. зняття з обліку'"));
	СтруктураПредставлениеПолей.Вставить( "ГрафикАмортизации"                   , НСтр("ru='График амортизации';uk='Графік амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "СпособОтраженияРасходовПоАмортизации", НСтр("ru='Сп. отраж. расх. по амортизации';uk='Сп. відобр. витр. по амортизації'"));
	
	СтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость"          ,   НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьДляВычисленияАмортизации", НСтр("ru='Стоимость для амортизации';uk='Вартість для амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "ЛиквидационнаяСтоимость"          , НСтр("ru='Ликвид. стоимость';uk='Ліквід. вартість'"));
	
	СтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования"               , НСтр("ru='Срок полезного использования';uk='Строк корисного використання'"));
	СтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации", НСтр("ru='Срок исп. для амортизации';uk='Строк викор. для амортизації'"));
	
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток", НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотДт"        , НСтр("ru='Увеличение стоимости';uk='Збільшення вартості'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотКт"        , НСтр("ru='Уменьшение стоимости';uk='Зменшення вартості'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток" ,  НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"));
	СтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость"      , НСтр("ru='Остаточная стоимость';uk='Залишкова вартість'"));
	
	СтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", НСтр("ru='Амортизация на начало периода';uk='Амортизація на початок періоду'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборотДт"        , НСтр("ru='Погашение амортизации';uk='Погашення амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборотКт"        , НСтр("ru='Амортизация за период';uk='Амортизація за період'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток" , НСтр("ru='Амортизация на конец периода';uk='Амортизація на кінець періоду'"));
	
	СтруктураПредставлениеПолей.Вставить( "ВыработкаОборот"                            , НСтр("ru='Выработка тек. периода';uk='Виробіток пот. періоду'"));
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРабот"                        , НСтр("ru='Объем продукции/работ';uk='Обсяг продукції/робіт'"));
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", НСтр("ru='Объем прод./раб. для амортизации';uk='Обсяг прод./роб. для амортизації'"));
	
	
	ПостроительОтчета.Текст     = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость"          , НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'") , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьДляВычисленияАмортизации", НСтр("ru='Стоимость для амортизации';uk='Вартість для амортизації'"), Ложь  , "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ЛиквидационнаяСтоимость"          , НСтр("ru='Ликвид. стоимость';uk='Ліквід. вартість'")        , Ложь  , "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СрокПолезногоИспользования"               , НСтр("ru='Срок полезного использования';uk='Строк корисного використання'"), Ложь, "ЧЦ=15");
	ОбщийОтчет.ЗаполнитьПоказатели( "СрокИспользованияДляВычисленияАмортизации", НСтр("ru='Срок исп. для амортизации';uk='Строк викор. для амортизації'")   , Ложь, "ЧЦ=15");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток", НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотДт"        , НСтр("ru='Увеличение стоимости';uk='Збільшення вартості'")       , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотКт",         НСтр("ru='Уменьшение стоимости';uk='Зменшення вартості'")       , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",  НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'") , Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОстаточнаяСтоимость",       НСтр("ru='Остаточная стоимость';uk='Залишкова вартість'")       , Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияНачальныйОстаток", НСтр("ru='Амортизация на начало периода';uk='Амортизація на початок періоду'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборотДт",         НСтр("ru='Погашение амортизации';uk='Погашення амортизації'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборотКт",         НСтр("ru='Амортизация за период';uk='Амортизація за період'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияКонечныйОстаток",  НСтр("ru='Амортизация на конец периода';uk='Амортизація на кінець періоду'"),  Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ВыработкаОборот"                            , НСтр("ru='Выработка тек. периода';uk='Виробіток пот. періоду'")          , Ложь, "ЧЦ=15; ЧДЦ=3");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОбъемПродукцииРабот"                        , НСтр("ru='Объем продукции/работ';uk='Обсяг продукції/робіт'")           , Ложь, "ЧЦ=15; ЧДЦ=3");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОбъемПродукцииРаботДляВычисленияАмортизации", НСтр("ru='Объем прод./раб. для амортизации';uk='Обсяг прод./роб. для амортизації'"), Ложь, "ЧЦ=15; ЧДЦ=3");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("ОсновноеСредство");
	МассивОтбора.Добавить("СнятоСУчета");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ПостроительОтчета.Параметры.Вставить( "СостояниеСнятоСУчета" , Перечисления.СостоянияОС.СнятоСУчета);
	ПостроительОтчета.Параметры.Вставить( "СубконтоОС"           ,	ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Добавляет в структуру общие для всех отчетов параметры настройки
//
// Параметры:
//	Нет.
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкиПостроителя", ОбщийОтчет.ПостроительОтчета.ПолучитьНастройки());
	СтруктураНастроек.Вставить("Показатели", ОбщийОтчет.Показатели.Выгрузить());
	СтруктураНастроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураНастроек.Вставить("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураНастроек.Вставить("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураНастроек.Вставить("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураНастроек.Вставить("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьСтруктуруДляСохраненияНастроек()()

// Заполняет из структуры настроек общие параметры отчетов
//
// Параметры:
//	Нет.
//
Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ПоказыватьЗаголовок) Экспорт
	Перем ТабПоказатели;
	
	Если ТипЗнч(ОбщийОтчет.СохраненныеНастройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
	
	СтруктураСНастройками.Свойство("Показатели", ТабПоказатели);
	Если ТипЗнч(ТабПоказатели) = Тип("ТаблицаЗначений") Тогда
		ОбщийОтчет.Показатели.Загрузить(ТабПоказатели);
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураСНастройками.Свойство("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураСНастройками.Свойство("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураСНастройками.Свойство("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураСНастройками.Свойство("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
КонецПроцедуры // ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки)()

ОбщийОтчет.ИмяРегистра          = "СтоимостьОС";
КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
ОбщийОтчет.мНазваниеОтчета      = НСтр("ru='Ведомость по амортизации ОС (бухгалтерский учет)';uk='Відомість по амортизації ОЗ (бухгалтерський облік)'", КодЯзыкаПечать);
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода   = 0;

#КонецЕсли
